app/controllers/attempts_controller.rb

  def create
    @attempt = @survey.attempts.new(params_whitelist)
    @attempt.participant = current_user
    if @attempt.valid? && @attempt.save
---
INSERT INTO "survey_attempts" ("survey_id", "participant_id", "participant_type", "score") VALUES ($1, $2, $3, $4) RETURNING "id"  [["survey_id", 1], ["participant_id", 1], ["participant_type", "User"], ["score", 0]]