app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`lastname`, `name`, `email`, `password_digest`, `admin`, `created_at`, `updated_at`, `remember_token`) VALUES ('Doga', 'Gabri', 'bestsuperflycode@gmail.com', '$2a$10$7E3hWsg.796DHIhuOAvMweBYwcVlONoUR09k3IteghPL4tp0CgLLe', 1, '2017-02-05 16:38:22', '2017-02-05 16:38:22', '17218380f277b6d8d76ce412378660bea89c8c97')